{"id":126,"date":"2023-06-30T08:14:52","date_gmt":"2023-06-30T08:14:52","guid":{"rendered":"https:\/\/storybook.spectator.co.uk\/?p=126"},"modified":"2023-06-30T08:14:52","modified_gmt":"2023-06-30T08:14:52","slug":"cranleigh-cadets-remember-flt-sgt-peter-brown","status":"publish","type":"post","link":"https:\/\/storybook.spectator.co.uk\/news\/cranleigh-cadets-remember-flt-sgt-peter-brown\/","title":{"rendered":"CRANLEIGH CADETS REMEMBER FLT SGT PETER BROWN"},"content":{"rendered":"<p>Flt Sgt Peter Brown, born on 22nd August 1926 – 17th December 2022, was a RAF volunteer pilot who served in a group of Afro-Caribbean volunteer RAF personnel now affectionately known as the “Pilots of the Caribbean”. Peter was enlisted in 1943, trained in Jamaica and Canada, worked as a wireless operator, and flew on Lancaster Bombers towards the end of the war. Despite restrictions of segregation and colonialism placed upon black people at the time, he and the rest of the pilots he flew with constantly proved others’ biases and judgements wrong. As Peter had moved to the UK to represent the colonies in the war at such a young age he had very few family members attending the funeral, so the RAF put a call out for people if they wished to come and pay their respects, and flew some of his family over from Jamaica. So many people wished to attend that they moved the funeral from its originally planned time and location, Mortlake Crematorium in south-west London in March, to the central RAF church, St Clement Danes in May. It was empowering to see so many uniting together to commemorate his life.<\/p>\n<p>The event itself was a sombre one, held on a fairly sunny day where hundreds of mourners gathered outside of the St Clements Dane Church along the Strand. Soon after arriving we were welcomed inside and provided with the opportunity to meet another group of Cadets who were currently in the ATC (Air Training Corps). We found this an interesting opportunity because it gave us insight into how other Cadets groups were run, specifically those which were not tied to schools, and this gave us a deeper appreciation for the hard work that many put in to make Cadets possible.<\/p>\n<p>Once the funeral began, we all were greatly appreciative of the quality of service that was delivered by the Chaplaincy. Powerful hymns and readings echoed throughout the magnificent Church building, but one thing that particularly stood out to us was the Tribute given by a neighbour, Melvyn Caplan, highlighting his and many others’ admiration of Flt Sgt Brown regarding his modesty about his achievements during the war and how he just wanted to get on with his life as normal. This held immense worth because the magnitude of Flt Sgt Brown’s legacy is not to be underestimated. This is because he was in fact the last living Afro-Caribbean pilot of WWII, which meant that the funeral became something that stood for much more than Flt Sgt Peter Brown.<\/p>\n<p>Another significant moment in the service was when the singer and British veteran Maurillia Simpson told the congregation about how she was injured in service and had recently had surgery on her spine after being paralysed. It was a truly amazing moment when she stood up and sang two incredibly symbolic songs for Flt Sgt Brown, the ultimate show of respect and gratitude for his life’s work.<\/p>\n<p>Once the funeral came to a close, we were invited outside for further conversation with the other attendees. We found this to be one of the most impactful parts of the day as it was touching to hear many of them speaking of how this was one of the first military organised events that had been mainly attended by an non-white British majority. We found reflecting on this event highly thought-provoking and although we were not able to empathise with the opportunity they had been given, we gained a deep respect for the privilege often being the majority in similar events.<\/p>\n<p>Overall, we found that the funeral was a day of great importance to many, not only because we were able to remember and celebrate the life of Flt Sgt Peter Brown, but also because we were able to witness a much deeper message be conveyed by many that highlighted the importance and underappreciation of Caribbean people’s invaluable contributions to military service and the war effort during WWII and subsequent service and contribution to Britain afterwards.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Flt Sgt Peter Brown, born on 22nd August 1926 – 17th December 2022, was a RAF volunteer pilot who served in a group of Afro-Caribbean volunteer RAF personnel now affectionately known as the “Pilots of the Caribbean”. Peter was enlisted in 1943, trained in Jamaica and Canada, worked as a wireless operator, and flew on<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[3],"tags":[],"_links":{"self":[{"href":"https:\/\/storybook.spectator.co.uk\/wp-json\/wp\/v2\/posts\/126"}],"collection":[{"href":"https:\/\/storybook.spectator.co.uk\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/storybook.spectator.co.uk\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/storybook.spectator.co.uk\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/storybook.spectator.co.uk\/wp-json\/wp\/v2\/comments?post=126"}],"version-history":[{"count":1,"href":"https:\/\/storybook.spectator.co.uk\/wp-json\/wp\/v2\/posts\/126\/revisions"}],"predecessor-version":[{"id":127,"href":"https:\/\/storybook.spectator.co.uk\/wp-json\/wp\/v2\/posts\/126\/revisions\/127"}],"wp:attachment":[{"href":"https:\/\/storybook.spectator.co.uk\/wp-json\/wp\/v2\/media?parent=126"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/storybook.spectator.co.uk\/wp-json\/wp\/v2\/categories?post=126"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/storybook.spectator.co.uk\/wp-json\/wp\/v2\/tags?post=126"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}