{"id":151,"date":"2023-07-10T07:07:15","date_gmt":"2023-07-10T07:07:15","guid":{"rendered":"https:\/\/storybook.spectator.co.uk\/?p=151"},"modified":"2023-07-10T07:07:49","modified_gmt":"2023-07-10T07:07:49","slug":"where-the-money-flows-how-data-on-climate-spending-is-informing-better-decision-making-in-chile","status":"publish","type":"post","link":"https:\/\/storybook.spectator.co.uk\/news\/where-the-money-flows-how-data-on-climate-spending-is-informing-better-decision-making-in-chile\/","title":{"rendered":"Where the money flows: How data on climate spending is informing better decision-making in Chile"},"content":{"rendered":"<div class=\"parbase section text\">\n<p><i>By Paloma Toranzos, Head of the Environment and Sustainable Development Programme and Fernando Córdova, Public Climate Expenditure Project Manager, <a href=\"https:\/\/edu.ndcs.undp.org\/\">PNUD<\/a> Chile<\/i><\/p>\n<p>Across Chile’s mountains, valleys and coasts, the fingerprints of climate change are becoming more and more evident. Rainfall is becoming more unpredictable. Extreme weather is on the rise.<\/p>\n<p>According to the Centre for Research on the Epidemiology of Disasters (EM-DAT), the country recorded 38 episodes of floods or catastrophic landslides, 12 severe storms, 13 wildfires, and nine episodes of extreme heat between 1970 and 2019 &#8212; around two million people were affected, with damages estimated at US$4.785 million.<\/p>\n<p>Such extreme climate events have become 30 times more frequent over the past fifty years.<\/p>\n<p>It’s also getting hotter and drier. The last decade has been the warmest in the last 100 years. Rainfall has been scarce in recent years – in 2020, the central zone of the country (from Coquimbo to Bío Bío) experienced an average precipitation deficit of 38 percent.<\/p>\n<p>Combined, the rainfall shortages and extreme heat have led to an unprecedented ‘mega-drought’ – with direct consequences for agricultural livelihoods and food security, and the health and overall quality of life of rural communities.<\/p>\n<\/div>\n<div class=\"image parbase section\">\n<figure><figcaption>In the context of severe ongoing drought, the Chilean Government’s efforts to secure water for vulnerable rural communities have been essential. Playing a key role are the Division of Hydraulic Works under the Ministry of Public Works and the National Irrigation Commission under the Ministry of Agriculture. Together they implement initiatives focused on the building, expansion, and improvement of rural drinking water systems that supply isolated communities disconnected from infrastructure. Photo credit: PNUD Chile<\/figcaption><\/figure>\n<\/div>\n<div class=\"parbase section text\">\n<h2>Data for decision-making<\/h2>\n<p>At the forefront of the government’s response to climate change, the Ministry for Finance and the Budget Office (Dirección de Presupuestos, or DIPRES) are leading several key initiatives. These include an effort to better understand public spending on climate change-related programmes and investments (adaptation and mitigation), including those related to water access.<\/p>\n<p>Under the NDC Support Programme, UNDP has been supporting the Ministry and DIPRES to advance its climate agenda, drawing on the methodologies Climate Public Expenditure and Institutional Review (CPEIR) and Climate Budget Tagging (CBT).<\/p>\n<p>The results so far include the identification of adaptation and mitigation initiatives across different ministries, including the Ministries for Public Works, Agriculture and Energy.<\/p>\n<p>For example, according to data available from the National System of Investment (Sistema Nacional de Inversiones, or SNI), 170 rural drinking water projects were developed between 2016 and 2020 across the Coquimbo, Valparaíso, O’Higgins and the Metropolitan regions (regions that face severe water scarcity and were recently declared to be under an agricultural emergency). More than 134 billion Chilean pesos (approximately US$6.5 billion), averaging around 27 billion pesos per year, have been channelled by the Ministry of Public Works and Regional Governments towards these projects.<\/p>\n<p>In another example, data gathered under the Bank of Social Programmes and Non-Social Programmes of the Ministry of Social Development and Family and DIPRES has revealed that of 32 programmes identified as associated with climate change, five addressed the impacts of water shortages.<\/p>\n<p>The data highlights significant government efforts already underway to address the impacts of climate change, with direct benefits for communities. However, and most importantly, the data also helps to identify the gaps, investment priorities, and policies which will allow Chile to continue to address climate change impacts in the years ahead. DIPRES has now committed to report the results annually to the Parliament.<\/p>\n<p>&#8220;By classifying public spending and its contribution to climate change, it is possible to evaluate the effect of policies and activities carried out at the national level, in addition to determining the efficiency and effectiveness of budget spending”, says Cristobal Gamboni, Macroeconomic and International Finance Coordinator at the Ministry of Finance.<\/p>\n<p>&#8220;This classification helps generate indicators for the management of climate spending, quantifying the fiscal cost of both mitigation and adaptation measures in the long-term, making their impact visible and deciding with more information – which also enables the alignment of environmental objectives, national objectives and international commitments.<\/p>\n<p>&#8220;This is why the Ministry of Finance of Chile considers it essential to have this kind of classification for public spending, giving priority to this work.&#8221;<\/p>\n<p>&nbsp;<\/p>\n<\/div>\n<div class=\"image parbase section\">\n<figure><img decoding=\"async\" class=\"cq-dd-image \" src=\"https:\/\/www.ndcs.undp.org\/content\/ndc-support-programme\/en\/home\/impact-and-learning\/ideas-and-insights\/2021\/where-the-money-flows\/_jcr_content\/main-content\/columnControl\/col-1\/image_251329381.img.jpg\/1637663948839.jpg\" srcset=\"where-the-money-flows\/_jcr_content\/main-content\/columnControl\/col-1\/image_251329381.img.jpg\/1637663948839.jpg\" data-srcset=\"\/content\/dam\/LECB\/img\/images\/undp-ndcsp-chile-where-the-money-flows-2.jpg\/_jcr_content\/renditions\/cq5dam.web.699.470.jpeg 470w, \/content\/dam\/LECB\/img\/images\/undp-ndcsp-chile-where-the-money-flows-2.jpg\/_jcr_content\/renditions\/cq5dam.web.540.390.jpeg 390w\" data-sizes=\"auto\" data-emptytext=\"Image\" \/><figcaption>The dedication of Chile’s Ministry of Finance to climate action extends to the global stage. The Ministry, for example, was a founding member of the international Coalition of Finance Ministers for Climate Action, co-leading the coalition until this year. In September 2021, the Ministry led a regional dialogue with Latin American and Caribbean countries on finance and climate change. Photo credit: Ministry of Finance, Chile<\/figcaption><\/figure>\n<\/div>\n<div class=\"parbase section text\">\n<p>&nbsp;<\/p>\n<h2>Looking ahead<\/h2>\n<p>With its diverse geography and a susceptibility to natural disasters, Chile is acutely vulnerable to climate change.<\/p>\n<p>The Chilean Government is focused on reducing this vulnerability by implementing a national Action Plan for Climate Change (2017-2022) and an enhanced Nationally Determined Contribution, while also closely examining the finance required.<\/p>\n<p>UNDP will now support the government in expanding the measurement of climate-related expenditures to other public institutions included in the Budget Law. The Private Sector Climate Expenditure and Institutional Review (PCEIR) may also inform the measurement of private investment.<\/p>\n<p>As the country seeks to promote low-carbon, sustainable and inclusive development, it is key to have a better comprehension of how money is being spent and how efficiently.<\/p>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>By Paloma Toranzos, Head of the Environment and Sustainable Development Programme and Fernando Córdova, Public Climate Expenditure Project Manager, PNUD Chile Across Chile’s mountains, valleys and coasts, the fingerprints of climate change are becoming more and more evident. Rainfall is becoming more unpredictable. Extreme weather is on the rise. According to the Centre for Research on<\/p>\n","protected":false},"author":1,"featured_media":153,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[3],"tags":[],"_links":{"self":[{"href":"https:\/\/storybook.spectator.co.uk\/wp-json\/wp\/v2\/posts\/151"}],"collection":[{"href":"https:\/\/storybook.spectator.co.uk\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/storybook.spectator.co.uk\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/storybook.spectator.co.uk\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/storybook.spectator.co.uk\/wp-json\/wp\/v2\/comments?post=151"}],"version-history":[{"count":1,"href":"https:\/\/storybook.spectator.co.uk\/wp-json\/wp\/v2\/posts\/151\/revisions"}],"predecessor-version":[{"id":152,"href":"https:\/\/storybook.spectator.co.uk\/wp-json\/wp\/v2\/posts\/151\/revisions\/152"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/storybook.spectator.co.uk\/wp-json\/wp\/v2\/media\/153"}],"wp:attachment":[{"href":"https:\/\/storybook.spectator.co.uk\/wp-json\/wp\/v2\/media?parent=151"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/storybook.spectator.co.uk\/wp-json\/wp\/v2\/categories?post=151"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/storybook.spectator.co.uk\/wp-json\/wp\/v2\/tags?post=151"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}