{"id":195,"date":"2023-07-26T06:54:38","date_gmt":"2023-07-26T06:54:38","guid":{"rendered":"https:\/\/storybook.spectator.co.uk\/?p=195"},"modified":"2023-07-26T06:54:38","modified_gmt":"2023-07-26T06:54:38","slug":"when-you-cant-believe-what-youre-seeing","status":"publish","type":"post","link":"https:\/\/storybook.spectator.co.uk\/news\/when-you-cant-believe-what-youre-seeing\/","title":{"rendered":"When You Can’t Believe What You’re Seeing"},"content":{"rendered":"<p>Nobody is quite sure where the term “kayfabe” originated. It may be a bastardized form of pig Latin, something to do with the actual word “fake.” It may have its roots in the culture of wandering 19th-century carnivals, the world inhabited by P.T. Barnum and the confidence men and the salesmen who sold actual snake oil.<\/p>\n<p>Its modern usage, though, is sufficiently specific that only a relatively small proportion of people would even have a sense of what it means. Kayfabe is, essentially, the illusory cloak that is doggedly draped over professional wrestling: the maintenance of the pretense that what you see in the ring is unscripted, competitive, what we would consider real.<\/p>\n<p>For decades, wrestlers were expected to keep kayfabe even when they were off the clock. The on-screen heroes and villains were not supposed to drive to events together, or to socialize together after them, in case they were seen and the illusion was broken. The omertà had to be upheld at all costs. Breaching it was not just a transgression. It was a betrayal.<\/p>\n<p>As Abraham Josephine Riesman delineates in “Ringmaster,” her magisterial biography of Vince McMahon — close personal friend of Donald Trump and longstanding, all-purpose tyrant behind World Wrestling Entertainment — there came a point, sometime around the 1990s, when that all felt just a little anachronistic.<\/p>\n<p>For anyone other than perhaps the very young, she posits, by that stage most wrestling fans had long understood the nature of what they were watching. More than that, they had delighted in it. Riesman’s theory is that the fun was not so much in seeing who won, but in trying to decode the why. What did this star’s propulsion mean for behind-the-scenes politics? What did this defeat indicate about the next twist in the never-ending tale?<\/p>\n<p>McMahon’s genius — again, in Riesman’s telling — was that he accepted the new reality. Rather than try to cling on to the tradition, to insist on the fantasy, he leaned into the wink and the nudge.<\/p>\n<p>Nobody ever said, of course, that the whole thing was a soap opera, a piece of brutal theater. But the sense that the real story could be found in what was happening backstage, that there was a political process behind who rose and who fell — all of that moved front and center. McMahon invented what Riesman calls neokayfabe.<\/p>\n<p>In the late 1980s and early 1990s, as McMahon was pioneering this new approach, soccer was changing, too. Delegations of executives from Europe’s major teams looked on jealously at the sporting landscape of the United States, where money flowed freely from television, through glamorous, lucrative leagues, and straight into their counterparts’ pockets.<\/p>\n<p>It was the N.F.L., with its cheerleaders and its fireworks and its sense of event, that caught their eyes particularly, and they returned home with whatever ideas they could mimic. Dance troupes appeared at midtable Premier League games. Flashy graphics and portentous music splashed across television screens. Stadiums modernized, attracting more families. That allowed ticket prices to increase and corporate sections to flourish.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Nobody is quite sure where the term “kayfabe” originated. It may be a bastardized form of pig Latin, something to do with the actual word “fake.” It may have its roots in the culture of wandering 19th-century carnivals, the world inhabited by P.T. Barnum and the confidence men and the salesmen who sold actual snake<\/p>\n","protected":false},"author":1,"featured_media":193,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[3],"tags":[],"_links":{"self":[{"href":"https:\/\/storybook.spectator.co.uk\/wp-json\/wp\/v2\/posts\/195"}],"collection":[{"href":"https:\/\/storybook.spectator.co.uk\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/storybook.spectator.co.uk\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/storybook.spectator.co.uk\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/storybook.spectator.co.uk\/wp-json\/wp\/v2\/comments?post=195"}],"version-history":[{"count":1,"href":"https:\/\/storybook.spectator.co.uk\/wp-json\/wp\/v2\/posts\/195\/revisions"}],"predecessor-version":[{"id":196,"href":"https:\/\/storybook.spectator.co.uk\/wp-json\/wp\/v2\/posts\/195\/revisions\/196"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/storybook.spectator.co.uk\/wp-json\/wp\/v2\/media\/193"}],"wp:attachment":[{"href":"https:\/\/storybook.spectator.co.uk\/wp-json\/wp\/v2\/media?parent=195"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/storybook.spectator.co.uk\/wp-json\/wp\/v2\/categories?post=195"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/storybook.spectator.co.uk\/wp-json\/wp\/v2\/tags?post=195"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}