{"id":197,"date":"2023-07-26T06:56:01","date_gmt":"2023-07-26T06:56:01","guid":{"rendered":"https:\/\/storybook.spectator.co.uk\/?p=197"},"modified":"2023-07-26T06:56:01","modified_gmt":"2023-07-26T06:56:01","slug":"ticketmaster-pauses-taylor-swifts-eras-tour-sale-in-france","status":"publish","type":"post","link":"https:\/\/storybook.spectator.co.uk\/news\/ticketmaster-pauses-taylor-swifts-eras-tour-sale-in-france\/","title":{"rendered":"Ticketmaster Pauses Taylor Swift’s Eras Tour Sale in France"},"content":{"rendered":"<p>Fans trying to purchase tickets to six of the pop superstar’s concerts faced long queues and technical issues before the company said that a new on-sale time would be announced. Ticketmaster has once again cracked under the weight of a Taylor Swift ticket sale — this time in France.<\/p>\n<p>As French fans prepared on Tuesday to purchase tickets to six concerts in May and June 2024 on Swift’s Eras Tour — four shows in Paris, two in Lyon — Ticketmaster’s website displayed a gigantic queue of customers ready to buy; one screenshot appeared to tell a fan that 1,023,504 shoppers were in line ahead of them.<\/p>\n<p>Soon, Ticketmaster announced that sales for those shows had been placed on “pause.” The company said that a new on-sale time would be announced, and that “all codes not already used will remain valid.” But some fans’ social media posts seemed to show technical errors on Ticketmaster’s website, including a progress icon that “keeps spinning and spinning and spinning,” as one fan — speaking English with an American accent, but with 762 euros’ worth of tickets in their shopping cart — put it.<\/p>\n<p>A few hours later, the French branch of Ticketmaster offered some more detail on social media, blaming the problem on a “third-party provider” that the company did not identify, and adding that tickets were still available. A representative of Live Nation Entertainment, Ticketmaster’s corporate parent, said that the provider works with Ticketmaster only in France.<\/p>\n<p>The situation in France appeared to be a frustrating repeat of the problems that plagued Swift’s North American presale in November, when an influx of millions of fans — and bots — overwhelmed Ticketmaster’s systems, and fans reported issues like tickets in their shopping carts disappearing before they could be purchased. Ticketmaster shut down its public sale as a result, though the company also said it had sold more than two million tickets to the tour in a single day.<\/p>\n<p>Problems like those at Swift’s presale in November — as well as long-simmering concerns over Ticketmaster and Live Nation’s market dominance — led to a brutal Senate Judiciary hearing in January. Senators from both parties flatly called the company a monopoly and were skeptical of an executive’s explanation that Ticketmaster was unable to defend itself against an onslaught of bots during Swift’s presale.<\/p>\n<p>“This is unbelievable,” Senator Marsha Blackburn, Republican of Tennessee, said at the hearing. “Why is it,” she added, “that you have not developed an algorithm to sort out what is a bot and what is a consumer?”<\/p>\n<p>Yet the demand for Swift tickets has been extraordinary, with Swift selling out stadiums everywhere she plays and tickets going for thousands of dollars on the secondary market. She is scheduled to complete the North American leg of her tour next month, then play in Latin America, Asia and Europe.<\/p>\n<p>The Justice Department has separately been conducting an antitrust investigation of Live Nation. The Justice Department has not confirmed that investigation, but Live Nation’s chief executive, Michael Rapino, has spoken about it openly.<\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Fans trying to purchase tickets to six of the pop superstar’s concerts faced long queues and technical issues before the company said that a new on-sale time would be announced. Ticketmaster has once again cracked under the weight of a Taylor Swift ticket sale — this time in France. As French fans prepared on Tuesday<\/p>\n","protected":false},"author":1,"featured_media":198,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[3],"tags":[],"_links":{"self":[{"href":"https:\/\/storybook.spectator.co.uk\/wp-json\/wp\/v2\/posts\/197"}],"collection":[{"href":"https:\/\/storybook.spectator.co.uk\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/storybook.spectator.co.uk\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/storybook.spectator.co.uk\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/storybook.spectator.co.uk\/wp-json\/wp\/v2\/comments?post=197"}],"version-history":[{"count":1,"href":"https:\/\/storybook.spectator.co.uk\/wp-json\/wp\/v2\/posts\/197\/revisions"}],"predecessor-version":[{"id":199,"href":"https:\/\/storybook.spectator.co.uk\/wp-json\/wp\/v2\/posts\/197\/revisions\/199"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/storybook.spectator.co.uk\/wp-json\/wp\/v2\/media\/198"}],"wp:attachment":[{"href":"https:\/\/storybook.spectator.co.uk\/wp-json\/wp\/v2\/media?parent=197"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/storybook.spectator.co.uk\/wp-json\/wp\/v2\/categories?post=197"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/storybook.spectator.co.uk\/wp-json\/wp\/v2\/tags?post=197"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}