{"id":229,"date":"2023-08-25T11:19:31","date_gmt":"2023-08-25T11:19:31","guid":{"rendered":"https:\/\/storybook.spectator.co.uk\/?p=229"},"modified":"2023-08-25T11:19:31","modified_gmt":"2023-08-25T11:19:31","slug":"fc-cincinnati-vs-inter-miami-live-score","status":"publish","type":"post","link":"https:\/\/storybook.spectator.co.uk\/news\/fc-cincinnati-vs-inter-miami-live-score\/","title":{"rendered":"FC Cincinnati vs Inter Miami Live Score"},"content":{"rendered":"<p>After a grueling Leagues Cup run, Lionel Messi and Inter Miami seemed to be running on fumes, but they continue to conjure just enough magic required each time they step on the field. In the U.S. Open Cup semifinals on the road against FC Cincinnati, the run would live on.<\/p>\n<p>Inter Miami fell 2-0 down to the physical MLS table-toppers, who looked every bit a Supporters&#8217; Shield leader for the first hour, but Messi provided two assists to Leo Campana for a late comeback, with the second coming seven minutes deep into added time to draw level at 2-2.<\/p>\n<p><a href=\"https:\/\/dazntv.online\/US\/\"><img decoding=\"async\" loading=\"lazy\" class=\" wp-image-230 aligncenter\" src=\"http:\/\/storybook.spectator.co.uk\/wp-content\/uploads\/2023\/08\/EFCm-1-300x77.gif\" alt=\"Lafc vs inter miami Live\" width=\"347\" height=\"89\" \/><\/a><\/p>\n<p>Josef Martinez struck early in extra-time on a feed from substitute Benji Cremaschi to give Inter Miami the lead, but Yuya Kubo grabbed his own equalizer in the 114th minute to pull FC Cincinnati back even.<\/p>\n<p>In the penalty shootout, Callender stopped Nick Hagglund&#8217;s effort in the fifth round to set up the win, and Cremaschi scored his spot-kick to send Inter Miami through to yet another Cup final, just days after securing the club&#8217;s first-ever trophy and keep Messi unbeaten in pink.<\/p>\n<p>Like Nashville SC before them, FC Cincinnati battered Inter Miami early and often, but they failed to capitalize on a host of chances to put the game away, and that would haunt them in the end.<\/p>\n<p>&nbsp;<\/p>\n<p><em>The Sporting News followed the FC Cincinnati vs Inter Miami match live, providing score updates, commentary and highlights as they happened.<\/em><\/p>\n<div class=\"twitter-tweet twitter-tweet-rendered\"><\/div>\n<h2><strong>FC Cincinnati vs Inter Miami final score<\/strong><\/h2>\n<div class=\"table-container\">\n<table border=\"1\" cellspacing=\"1\" cellpadding=\"1\">\n<tbody>\n<tr class=\"odd\">\n<td><\/td>\n<td class=\"text-align-center\"><strong>Final<\/strong><\/td>\n<td class=\"text-align-center\"><strong>Pen<\/strong><\/td>\n<td class=\"text-align-center\"><strong>Goalscorers<\/strong><\/td>\n<\/tr>\n<tr class=\"even\">\n<td><strong>FC Cincinnati<\/strong><\/td>\n<td><b>3<\/b><\/td>\n<td><b>4<\/b><\/td>\n<td>Acosta (18&#8242;),<br \/>\nVazquez (53&#8242;),<br \/>\nKubo (114&#8242;)<\/td>\n<\/tr>\n<tr class=\"odd\">\n<td><strong><b>Inter Miami<\/b><\/strong><\/td>\n<td><b>3<\/b><\/td>\n<td><b>5<\/b><\/td>\n<td>Campana (68&#8242;, 90+7&#8242;),<br \/>\nMartinez (93&#8242;)<\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<\/div>\n<div id=\"adPlaceholder-0\"><\/div>\n<h3><strong>FC Cincinnati vs Inter Miami penalty shootout<\/strong><\/h3>\n<div class=\"table-container\">\n<table border=\"1\" cellspacing=\"1\" cellpadding=\"1\">\n<tbody>\n<tr>\n<td><\/td>\n<td>R1<\/td>\n<td>R2<\/td>\n<td>R3<\/td>\n<td>R4<\/td>\n<td>R5<\/td>\n<\/tr>\n<tr>\n<td><strong>FC Cincinnati<\/strong><\/td>\n<td class=\"text-align-center\">O<\/td>\n<td class=\"text-align-center\">O<\/td>\n<td class=\"text-align-center\">O<\/td>\n<td class=\"text-align-center\">O<\/td>\n<td class=\"text-align-center\">X<\/td>\n<\/tr>\n<tr>\n<td><b>Inter Miami<\/b><\/td>\n<td class=\"text-align-center\">O<\/td>\n<td class=\"text-align-center\">O<\/td>\n<td class=\"text-align-center\">O<\/td>\n<td class=\"text-align-center\">O<\/td>\n<td class=\"text-align-center\">O<\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<\/div>\n<p><strong>Starting lineups:<\/strong><\/p>\n<p><strong>FC Cincinnati (3-4-1-2, right to left):<\/strong> 1. Kann (GK) — 4. Hagglund, 21. Miazga, 32. I. Murphy (Powell, 88&#8242;) — 13. Arias (Halsey, 106&#8242;), 93. Moreno (Angulo, 88&#8242;), 5. Nwobodo, 31. Barreal — 10. L. Acosta (Gaddis, 88&#8242;) — 9. Boupendza (Kubo, 62&#8242;), 19. Vazquez (Santos, 78&#8242;).<\/p>\n<p><strong>Inter Miami (3-5-2, right to left):<\/strong> 1. Callender (GK) — 27. Kryvtsov, 6. Aviles (Allen, 78&#8242;), 31. Miller (Taylor, 58&#8242;) — 2. Yedlin (Farias, 58&#8242;), 8. D. Gomez (Martinez, 78&#8242;), 5. Busquets, 7. Mota (Ruiz, 58&#8242;), 18. Alba — 10. Messi, 9. Campana (Cremaschi, 91&#8242;).<\/p>\n<h2><strong>FC Cincinnati vs Inter Miami<\/strong> live updates, highlights, commentary<\/h2>\n<h3>FC Cincinnati vs. Inter Miami: Penalty shootout<\/h3>\n<p><strong><u>Round 5<\/u><\/strong><\/p>\n<p><strong>FC Cincinnati:<\/strong> The hosts send another defender up in <strong>Nick Hagglund<\/strong>, and his effort is&#8230;<u><em>SAVED<\/em><\/u>! DRAKE CALLENDER MAKES THE SAVE! It&#8217;s a poor penalty, far too central, and Callender picks it out easily!<\/p>\n<p><strong>Inter Miami:<\/strong> Here&#8217;s 18-year-old <strong>Benji Cremaschi<\/strong> who assisted the go-ahead goal in extra-time, and the young midfielder&#8230;<u><em>SCORES<\/em><\/u>! INTER MIAMI ADVANCE!<\/p>\n<div id=\"adPlaceholder-1\"><\/div>\n<div class=\"twitter-tweet twitter-tweet-rendered\"><\/div>\n<p><b><u>Round 4<\/u><\/b><\/p>\n<p><strong>FC Cincinnati:<\/strong> USMNT defender <strong>Matt Miazga<\/strong> steps up wearing the captain&#8217;s armband, and he&#8230;<u><em>SCORES<\/em><\/u>! He sends Callender the wrong way!<\/p>\n<p><strong>Inter Miami:<\/strong> Next is striker <strong>Josef Martinez<\/strong>, who&#8230;<u><em>SCORES<\/em><\/u>! He got Alec Kann tied up in knots, and with the goalkeeper rooted, he deposits the delivery.<\/p>\n<p><strong><u>Round 3<\/u><\/strong><\/p>\n<p><strong>FC Cincinnati:<\/strong> Here is <strong>Sergio Santos<\/strong> who&#8230;<u><em>SCORES<\/em><\/u>! Another top-shelf rip, unstoppable penalty.<\/p>\n<p><strong>Inter Miami:<\/strong> Now it&#8217;s another youngster for Inter Miami, as <strong>David Ruiz<\/strong>&#8230;<u><em>SCORES<\/em><\/u>! A stutter step is followed by yet <em>another<\/em> howitzer of a penalty. Nobody&#8217;s missed yet!<\/p>\n<p><strong><u>Round 2<\/u><\/strong><\/p>\n<p><strong>FC Cincinnati:<\/strong> Up next is <strong>Santiago Arias<\/strong> who&#8230;<u><em>SCORES<\/em><\/u>! He sends Callender the wrong way.<\/p>\n<div id=\"adPlaceholder-2\"><\/div>\n<p><strong>Inter Miami:<\/strong> On his Inter Miami debut it&#8217;s <strong>Facundo Farias <\/strong>to step up, and the 20-year-old <u><em>SCORES<\/em><\/u>! It&#8217;s an absolute blast into the top corner.<\/p>\n<p><strong><u>Round 1<\/u><\/strong><\/p>\n<p><strong>FC Cincinnati:<\/strong> FC Cincinnati win the toss, and Matt Miazga elects to shoot first. Stepping up first is <strong>Yuya Kubo<\/strong> who scored the equalizer. He&#8230;<em><u>SCORES<\/u><\/em>! Low and hard to the right, Drake Callender guesses right but is late to dive.<\/p>\n<p><strong>Inter Miami:<\/strong> Of course it&#8217;s <b>Lionel Messi<\/b> up first for Inter Miami, as he was each of the last two times, and he&#8230;<u><em>SCORES<\/em><\/u>! He chips it left and sends Alec Kann the wrong way.<\/p>\n<div class=\"twitter-tweet twitter-tweet-rendered\"><\/div>\n<h3>END OF EXTRA-TIME: FC Cincinnati 3-3 Inter Miami<\/h3>\n<p>To penalties we go! Inter Miami climbed all the way back from a 2-0 deficit to take the lead, but FC Cincinnati wouldn&#8217;t die either, and the 120 minutes finish level. Bring on the shootout! Lionel Messi has emerged victorious from both his previous penalty shootouts with Inter Miami in the Leagues Cup, including the final. Drake Callender has been fantastic so far.<\/p>\n<div class=\"twitter-tweet twitter-tweet-rendered\"><\/div>\n<h3>FC Cincinnati vs. Inter Miami: Extra time<\/h3>\n<p><strong>117th min:<\/strong> Ohhhh boy, we&#8217;re in Messi free-kick territory. David Ruiz carves his way right down FC Cincinnati&#8217;s throat, and is eventually fouled centrally outside the top of the penalty area. Messi steps up and hits it well, but he can&#8217;t find the top corner this time, seeing his blast instead fall into the goalkeeper&#8217;s grasp.<\/p>\n<p><a id=\"3-3\" role=\"presentation\" name=\"3-3\" aria-hidden=\"true\"><\/a><strong>114th min: GOAL! FC CINCINNATI!<\/strong> INTER MIAMI AREN&#8217;T THE ONLY ONES CAPABLE OF A LATE COMEBACK! The visitors are punished for trying to see out the game, and Yuya Kubo takes advantage of a deflected cross which falls at his feet, taking one touch onto his right foot and blasting it into the top corner from 15 yards out. WE&#8217;RE LEVEL AGAIN!<\/p>\n<div id=\"adPlaceholder-3\"><\/div>\n<div class=\"twitter-tweet twitter-tweet-rendered\"><\/div>\n<p><strong>112th min:<\/strong> Inter Miami are looking to kill the game by taking the air out of the ball. Every time they get it, the ball gets cycled back through the defense and eventually the goalkeeper. They have no intention of playing the ball forward unless they absolutely have to. FC Cincinnati are attacking as best they can, but Sergio Santos and Yuya Kubo seem to be running out of ideas.<\/p>\n<p><strong>108th min:<\/strong> Lionel Messi is just showing off now. He&#8217;s dribbling through multiple defenders just trying to eat clock and buy his team a few more seconds to rest. The crowd has a cheer once he&#8217;s finally dispossessed, but he accomplished his goal.<\/p>\n<p><strong>Kickoff:<\/strong> Santiago Arias, just moments after rattling the crossbar, is substituted off in FC Cincinnati&#8217;s final change, with Bret Halsey entering.<\/p>\n<div class=\"twitter-tweet twitter-tweet-rendered\"><\/div>\n<p><strong>HALFTIME: <\/strong>The referee blows the whistle and boos rain down, but the TQL Stadium fans are a bit biased, and they won&#8217;t want to admit that&#8217;s the right call. FC Cincinnati have been electric since falling behind, but the clock is their enemy. Inter Miami will have to dig deep to hold this lead, there&#8217;s no more substitutes left for Tata Martino to make.<\/p>\n<div class=\"twitter-tweet twitter-tweet-rendered\"><\/div>\n<p><strong>104th min: Chance, FC Cincinnati!<\/strong> THE HOSTS HIT THE POST! A corner is swung in and the header from Santiago Arias clatters the woodwork! That&#8217;s a thumping effort but it clangs the crossbar!<\/p>\n<p>Then moments later on the recycle, FC Cincinnati players are screaming for a penalty after a Nick Hagglund shot hits the arm of a defender, but it&#8217;s very clearly sucked in on his chest and there&#8217;s nothing in that at all. VAR has a look but play continues with no penalty, which is the correct call.<\/p>\n<p><strong>102nd min:<\/strong> Nick Hagglund makes a run down the flank and delivers a cross with Sergio Santos making a run, but the ball is too tight to the goalkeeper and Drake Callender has it in his grasp. It&#8217;s been all FC Cincinnati since the Inter Miami goal.<\/p>\n<div id=\"adPlaceholder-4\"><\/div>\n<p><strong>97th min:<\/strong> FC Cincinnati have responded brightly to falling behind, but Robert Taylor makes a great tackle at pace to prevent a cross on his flank. Sergio Busquets gives it a round of applause.<\/p>\n<p><a id=\"2-3\" role=\"presentation\" name=\"2-3\" aria-hidden=\"true\"><\/a><strong>93rd min: GOAL! INTER MIAMI!<\/strong> THEY&#8217;VE TURNED IT AROUND! It&#8217;s the substitute Benji Cremaschi who makes it happen, receiving the ball in midfield with his back to goal and turning wonderfully, creating space before feeding a vertical ball to Josef Martinez who does the rest with the finish.<\/p>\n<div class=\"twitter-tweet twitter-tweet-rendered\"><\/div>\n<p><strong>Kickoff:<\/strong> FC Cincinnati are in a bit of trouble now. They have withdrawn all three of their attackers, especially Luciano Acosta, who appeared completely out of gas. They&#8217;ll need to have others step up if they are to win this and reach the final.<\/p>\n<p>Tata Martino uses his additional extra-time sub immediately, bringing Benji Cremaschi on for Leonardo Campana.<\/p>\n<h3>END OF REGULATION: FC Cincinnati 2-2 Inter Miami<\/h3>\n<p>FC Cincinnati dominated long stretches of this match, and seemed good enough for victory over Inter Miami, but Lionel Messi just refused to quit, and his deep assist conjures up a comeback.<\/p>\n<p>The hosts are punished for not going to the corner flag and eating up the final seconds. Incredible. 30 more minutes are on the horizon!<\/p>\n<div class=\"twitter-tweet twitter-tweet-rendered\"><\/div>\n<h3><strong>FC Cincinnati vs Inter Miami: <\/strong>Second Half<\/h3>\n<p><a id=\"2-2\" role=\"presentation\" name=\"2-2\" aria-hidden=\"true\"><\/a><b>90+7 min: GOAL! INTER MIAMI!<\/b> YOU CAN&#8217;T BE SERIOUS! LEO MESSI ASSISTS LEONARDO CAMPANA AGAIN AND WE&#8217;RE LEVEL JUST SECONDS FROM THE END OF THE MATCH! A deep cross to the far post is right onto Campana&#8217;s head, and while Alec Kann got a fingertip to it, he can&#8217;t keep it out!<\/p>\n<div id=\"adPlaceholder-5\"><\/div>\n<p>Messi has saved this team again and surely we&#8217;re going to extra-time!<\/p>\n<div class=\"twitter-tweet twitter-tweet-rendered\"><\/div>\n<div class=\"twitter-tweet twitter-tweet-rendered\"><\/div>\n<p><strong>90+5 min:<\/strong> Inter Miami are out of ideas. Lionel Messi tries to do it all himself from midfield, but he&#8217;s sandwiched and dispossessed. FC Cincinnati nearly put it away on the break but a heavy touch by Marco Angulo sees it evaporate.<\/p>\n<p><strong>89th min:<\/strong> Alvaro Barreal is booked for wildly swinging his boot at the ball while laying on the ground. A whopping eight minutes of added time are shown! That&#8217;s so much!<\/p>\n<p><strong>86th min:<\/strong> Luciano Acosta is booked for accumulation as he fouls Leo Campana with a push from behind. FC Cincinnati are readying a triple substitution, but choose not to do it just yet.<\/p>\n<p>Eventually, Raymon Gaddis, Marco Angulo, and Alvas Powell all come on. Luciano Acosta is one of those withdrawn, as he hands off the captain&#8217;s armband and limps off.<\/p>\n<div class=\"twitter-tweet twitter-tweet-rendered\"><\/div>\n<p><strong>82nd min:<\/strong> Goodness, Inter Miami survive another scare after switching off defensively. Luciano Acosta is again a creative force in feeding a great cross in front of net, but it&#8217;s just out of reach of his teammate streaking in front of goal.<\/p>\n<p><strong>80th min:<\/strong> Serhiy Kryvtsov picks up a booking for a bad foul on Alvaro Barreal, on whom the Ukrainian defender commits a clearly intentional foul in midfield having been skinned on the break. In the aftermath, Tata Martino is also booked, and I&#8217;m not sure what he could be arguing about.<\/p>\n<p><strong>78th min:<\/strong> Out of the second half cooling break, Inter Miami makes another two changes. Josef Martinez replaces Diego Gomez, while Noah Allen also enters for Tomas Aviles in defense. FC Cincinnati counters by taking off Brandon Vazquez for Sergio Santos.<\/p>\n<div id=\"adPlaceholder-6\"><\/div>\n<p><strong>74th min: Chance, FC Cincinnati!<\/strong> Yuya Kubo is causing so many problems! Luciano Acosta finds him on a through ball, and while the Inter Miami wave for offside, Kubo blasts one on net that forces Drake Callender into a huge save while far from his net! Inter Miami have survived a few body blows here since their goal, and have to be careful of giving it right back.<\/p>\n<div class=\"twitter-tweet twitter-tweet-rendered\"><\/div>\n<p><strong>72nd min: Chance, FC Cincinnati!<\/strong> The hosts have a goal chalked off for the second time today! Yuya Kubo deflects a corner into the back of the net, but the whistle blows! I think it&#8217;s for handball, which is incredibly harsh, but the correct call based on the rules. The ball clips up off Kubo&#8217;s thigh and into his arm before he settles, and as an attacker, that&#8217;s enough to ruled out. Unlucky!<\/p>\n<p><strong>70th min:<\/strong> FC Cincinnati have a dangerous free-kick of their own as Tomas Aviles is booked for taking down Brandon Vazquez just outside the 18-yard box. Alvaro Barreal comes very close, but Drake Callender had it covered, tipping the ball over the end line past the far post.<\/p>\n<p><a id=\"2-1\" role=\"presentation\" name=\"2-1\" aria-hidden=\"true\"><\/a><strong>68th min: GOAL! INTER MIAMI!<\/strong> GAME ON! Facundo Farias is flattened out wide to win a free-kick. On the set-piece, Lionel Messi picks up his second Inter Miami assist as he finds the head of Leo Campana for a <em>thumping<\/em> finish! Messi put that right on a platter for his strike partner!<\/p>\n<div class=\"twitter-tweet twitter-tweet-rendered\"><\/div>\n<p><strong>63rd min:<\/strong> FC Cincinnati make their first change, with Yuya Kubo entering the field for Aaron Boupendza. He&#8217;s involved immediately, but a through-ball takes him just too wide and his shot is right into Drake Callender&#8217;s bread basket.<\/p>\n<p><strong>60th min:<\/strong> The new Inter Miami shape is their more traditional 4-3-3. Robert Taylor is playing right-back, while David Ruiz goes into midfield and Facundo Farias, on for his first appearance for the club, is going to help Messi pull strings up front.<\/p>\n<p><strong>56th min:<\/strong> Tata Martino may regret not making any halftime substitutions. He readies a triple substitution immediately after the goal. Robert Taylor will be one of the players to come on shortly, replacing defender Kamal Miller, which signals a change in formation. DeAndre Yedlin and Jean Mota are also withdrawn, replaced by David Ruiz and Inter Miami debutant Facundo Farias.<\/p>\n<div id=\"adPlaceholder-7\"><\/div>\n<p><a id=\"2-0\" role=\"presentation\" name=\"2-0\" aria-hidden=\"true\"><\/a><strong>53rd min: GOAL! FC CINCINNATI!<\/strong> Off a pinball counter, it&#8217;s Brandon Vazquez with a low, driven finish from outside the box! The USMNT striker didn&#8217;t appear to be in a terribly dangerous position, but no Inter Miami defender steps to him trailing the play, and he rifles a shot perfectly inside the far post.<\/p>\n<div class=\"twitter-tweet twitter-tweet-rendered\"><\/div>\n<p><strong>49th min:<\/strong> Diego Gomez wins a foul as he gets to the ball before Aaron Boupendza, and then takes an elbow to the back. Inter Miami frustration with the physicality is starting to bubble over, as Serhiy Kryvtsov comes in and has words with Boupendza. It&#8217;s not inconceivable for this match to reach a boiling point soon.<\/p>\n<p><strong>Kickoff:<\/strong> FC Cincinnati kick the second half off as Lionel Messi is tying is boots. No changes for Inter Miami, as Gerardo Martino is (for now) sticking with his original plan. It wasn&#8217;t a bright first 45 minutes, but they only trail by one, and we all know what Lionel Messi can do at any point.<\/p>\n<h3>HALFTIME: FC Cincinnati 1-0 Inter Miami<\/h3>\n<p>The hosts possess the rest of the way and take the air out of the ball, all the way to the halftime whistle. Lionel Messi appears clearly frustrated as he walks to the tunnel, after a 45-minute spell kept entirely in check. Messi finished that half with just 32 touches, and while he was tidy in possession, he did little to create much in front of goal, either for himself or others.<\/p>\n<p>FC Cincinnati were very physical in that half, but unlike other prior Inter Miami opponents, they kept their heads, avoided bad fouls, and frustrated the Messi-led squad to its detriment. A statement from the hosts through 45 minutes, but it&#8217;s far from over. Let&#8217;s see what Tata Martino has in store, despite having just seven available players on the bench in this competition.<\/p>\n<div class=\"twitter-tweet twitter-tweet-rendered\"><\/div>\n<h3><strong>FC Cincinnati vs Inter Miami: <\/strong>First Half<\/h3>\n<p><strong>45+3 min:<\/strong> This is getting <i>very<\/i> physical. Sergio Busquets first commits a foul, and then is clipped moments after the restart. It hasn&#8217;t boiled over yet, but both teams — Inter Miami in particular — are voicing clear frustration.<\/p>\n<p>Diego Gomez heads DeAndre Yedlin&#8217;s cross well over the crossbar.<\/p>\n<div id=\"adPlaceholder-8\"><\/div>\n<p><strong>44th min:<\/strong> FC Cincinnati have done very well to limit Lionel Messi, as the Argentine has just 23 touches so far. Against other teams, role players on Inter Miami stepped up to punish the added attention on Messi, but here, with multiple changes to the lineup, there&#8217;s not been anyone to carry the load.<\/p>\n<p>Jean Mota sends a deep cross miles over the penalty area and over the end line on the fly. So disjointed for Inter Miami thus far, as the FC Cincinnati defense looks comfortable. 6 minutes of added time is shown.<\/p>\n<p><strong>41st min:<\/strong> A third booking of the first half, and second to Inter Miami, as Jean Mota gets a yellow for catching Obinna Nwobodo late. It&#8217;s not dangerous, but a caution is well-earned as Mota stuck his leg <em>very<\/em> far out, and was really in no position to make a tackle there.<\/p>\n<p><strong>36th min:<\/strong> There&#8217;s a real lack of flow to this game now. Serhiy Kryvtsov bangs knees with an opponent and is down in a lot of pain, needing treatment. This does look a nasty one, and play stops for quite some time for him to receive treatment. The 32-year-old Ukrainian eventually does continue, but he&#8217;ll be watched. There will be a lot of added time before the break.<\/p>\n<p><strong>31st min:<\/strong> Now a booking for FC Cincinnati midfielder Obinna Nwobodo who catches Diego Gomez very late and steps on his foot. That is a proper booking.<\/p>\n<p>Sergio Busquets looks as if he wants a red, but the referee isn&#8217;t having any of his protests. The teams pause for hydration, it&#8217;s 95 degrees (!!!) in Cincinnati.<\/p>\n<div class=\"twitter-tweet twitter-tweet-rendered\"><\/div>\n<p><strong>24th min:<\/strong> The game&#8217;s first yellow card is shown to Jordi Alba after catching Santiago Arias late in possession. It&#8217;s a soft yellow, there was really no injury risk on that tackle. Late, sure, but not at all dangerous. A harsh booking this early in the match.<\/p>\n<div id=\"adPlaceholder-9\"><\/div>\n<p><strong>22nd min: Chance, Inter Miami!<\/strong> Just after the match restarted following Boupendza&#8217;s nullified goal, Inter Miami have their first true opportunity! Diego Gomez&#8217;s tight-angle blast is saved well by Alec Kann at the near post. Good stop!<\/p>\n<p><strong>21st min: Chance, FC Cincinnati!<\/strong> Aaron Boupendza has the ball in the net after chipping Drake Callender, but the offside flag rules it out! He&#8217;s played clean through on a ball from deep, but he&#8217;s definitely leaning offside, which replay confirms!<\/p>\n<p><a id=\"1-0\" role=\"presentation\" name=\"1-0\" aria-hidden=\"true\"><\/a><strong>20th min: GOAL! FC CINCINNATI!<\/strong> Luciano Acosta opens the scoring by sneaking one past Drake Callender at the near post! That&#8217;s not one Inter Miami will want to watch back, both defenders (Kamal Miller and Tomas Aviles) could have done better, and Callender&#8217;s save attempt was awkward. There may have been a deflection involved.<\/p>\n<p>The <em>other<\/em> Argentine No. 10 scores! This is the first time since Lionel Messi has joined that Inter Miami did not score the game&#8217;s first goal.<\/p>\n<div class=\"twitter-tweet twitter-tweet-rendered\"><\/div>\n<p><strong>14th min:<\/strong> Leo Campana has one for the Yakety Sax reel, all in good fun. The through ball for him brings the Inter Miami striker too far wide for a good shot, and all he can do is swing his foot at it before the ball skids over the end line. It&#8230;doesn&#8217;t end well for Campana, as he whiffs and ends up on his backside. They&#8217;ll have a good laugh watching that one at the holiday party.<\/p>\n<p>This game has been stagnant through the opening stages. Inter Miami look as if they are struggling to adapt to the tactical and personnel changes from an attacking standpoint. Neither back line has been tested yet.<\/p>\n<div class=\"twitter-tweet twitter-tweet-rendered\"><\/div>\n<p><strong>11th min:<\/strong> Keeping with the theme, Lionel Messi tries to play a vertical ball for Jean Mota but the Brazilian goes down under heavy defensive pressure. No whistle comes, and Mota flails around on the ground with the ball stuck under him until he&#8217;s called for the foul.<\/p>\n<div id=\"adPlaceholder-10\"><\/div>\n<p><strong>8th min:<\/strong> FC Cincinnati are looking to muck this game up early. Aaron Boupendza&#8217;s antics on the turf in the earlier collision with DeAndre Yedlin were&#8230;a lot, and now Luciano Acosta scythes Sergio Busquets in midfield. Now Tomas Aviles is down and has words for the referee as he complains about the back of his foot being stamped on off the ball.<\/p>\n<p>The hosts are not backing down physically, but that approach has backfired for other clubs in matchups against Lionel Messi&#8217;s Inter Miami throughout the Leagues Cup.<\/p>\n<p><strong>4th min:<\/strong> Inter Miami have possessed through most of the early minutes through the opening three minutes of this match, but FC Cincinnati are not yet troubled, and finally do get a spell on the ball. An attacking build results in a collision in the penalty area, and players for each team are down on the turf in pain. It&#8217;s DeAndre Yedlin and Aaron Boupendza.<\/p>\n<p>U.S. fans are treated to Ray Hudson on the call, which is just the way the universe wants it with Lionel Messi on the field. Hudson partnered with tonight&#8217;s play-by-play Dre Cordero on Inter Miami TV broadcasters during last season&#8217;s MLS campaign.<\/p>\n<p><strong>Kickoff:<\/strong> This semifinal of the 2023 U.S. Open Cup has begun! The best team in the Eastern Conference, and the worst team in the Eastern Conference meet in Cincinnati. Some other Cincinnati athletes are in attendance to watch their fellow Ohio pro team!<\/p>\n<div class=\"twitter-tweet twitter-tweet-rendered\"><\/div>\n<h3><strong>FC Cincinnati vs Inter Miami<\/strong>: Pre-match commentary, analysis, stats, and more<\/h3>\n<p><strong>15 mins to kick:<\/strong> Interestingly, teams are only afforded seven available substitutes on the bench for U.S. Open Cup matches, which is fewer than usual. Teams were afforded 12 players on the bench through the Leagues Cup, while MLS games afford teams nine throughout the season, which are both consistent with European league and Cup competitions.<\/p>\n<p>Despite having only seven bench players available on each team, both clubs are still allowed the usual five substitutions, as well as three sub windows outside of the halftime break. With this, most players made available for this game will likely get on the field.<\/p>\n<p><strong>30 mins to kick:<\/strong> DeAndre Yedlin joined the CBS Sports pregame show, and made it clear that while the last month was understandably fun, they aren&#8217;t resting on their laurels after making history.<\/p>\n<p><strong>45 mins to kick:<\/strong> Lineups are in, and after using the same lineup throughout the Leagues Cup, Tata Martino has made a host of changes to the Inter Miami XI. Lionel Messi remains, as do Sergio Busquets and Jordi Alba, but there&#8217;s a formational switch as three center-backs are present.<\/p>\n<p>20-year-old midfielder Diego Gomez and 19-year-old defender Tomas Aviles both start, as does Brazilian midfielder Jean Mota who hasn&#8217;t played in months due to injury.<\/p>\n<p>For FC Cincinnati, goalkeeper Alec Kann comes in as the Cup starter, while Matt Miazga returns from suspension along the back line.<\/p>\n<p><strong>1 hour to kick:<\/strong> Tonight&#8217;s U.S. broadcast on Paramount+, which will be viewable for free on the CBS Sports Golazo Network, will feature some unique quirks.<\/p>\n<p>According to CBS, the streamed broadcast will feature a &#8220;Star Cam&#8221; option which will only focus on Lionel Messi. Additionally, USMNT star Christian Pulisic will join the network&#8217;s prematch show which begins an hour before kickoff — so, right now.<\/p>\n<p><strong>1 hour 15 mins to kick:<\/strong> Inter Miami&#8217;s American goalkeeper Drake Callender has been included on Gregg Berhalter&#8217;s provisional roster for the USMNT September friendlies against Uzbekestan and Oman, according to Fox reporter Doug McIntyre.<\/p>\n<p>So too has midfielder Benji Cremaschi, who is just 18 years old and a dual international with Argentina. Cremaschi has blossomed since Lionel Messi&#8217;s arrival at Inter Miami, becoming a regular starter for Tata Martino, and he has yet to commit for a senior national team, having played for both nations at the youth level — he actually trained with each youth team in consecutive months last fall.<\/p>\n<div id=\"adPlaceholder-12\"><\/div>\n<p>Cremaschi would not be cap-tied playing in the September friendlies, but it surely would go a long way to see him in a USA jersey.<\/p>\n<p><strong>1 hour 30 mins to kick:<\/strong> Much has been made of Lionel Messi&#8217;s flow during a game, and how much he walks. It&#8217;s not an inaccurate thing to say that Messi walks a ton — in fact, there&#8217;s data to back that up. But what&#8217;s amazing is just how unpredictable he is. He&#8217;s not lazy, he&#8217;s simply reading the game to find openings.<\/p>\n<p>Pablo Maurer of The Athletic produced a wonderful article by spending a whole match with his camera trying to photograph Messi. He points out that as a photographer, learning a player&#8217;s movement and tendencies is helpful to predict where they will be and what they will do, to get the best shot. He then concludes that what makes Messi so hard to defend is his unpredictability.<\/p>\n<p>That is all on full display with this excellent video of Messi&#8217;s goal against Nashville SC. He spends significant time walking, before bursting into an attacking move and changing direction at lightning speed. Nobody knows what is coming.<\/p>\n<p><strong>1 hour 45 mins to kick:<\/strong> Lionel Messi is getting close to a career record. He has scored a goal in eight straight games for club and country, dating back to his goal for Argentina in a 1-0 friendly win over Australia earlier this summer. Tack on at least a goal in all seven Leagues Cup games, and Messi stands close to his all-time record of 10, which he&#8217;s done twice.<\/p>\n<p>Can he extend that streak tonight and put himself in a position to tie his personal best on the weekend, when he makes his MLS debut?<\/p>\n<p><strong>2 hours to kickoff:<\/strong> Welcome to the Sporting News&#8217; live coverage of the U.S. Open Cup semifinals. Lionel Messi&#8217;s start to his Inter Miami career has been sensational, with 10 goals in his first seven games. But his off-field presence has been equally as spectacular, proving not only one of the world&#8217;s best players but also the world&#8217;s best captains.<\/p>\n<div id=\"adPlaceholder-13\"><\/div>\n<p>The Sporting News has compiled some of the best moments of Messi&#8217;s first month in the United States off the field as the Argentine proves just as capable a leader as he is a goalscorer:<\/p>\n<h2><strong>FC Cincinnati vs Inter Miami<\/strong> lineups &amp; team news<\/h2>\n<p>An injury to mainstay center-back <strong>Yerson Mosquera<\/strong> is a blow to the Cincinnati defense, which was laid bare in their weekend defeat at Columbus Crew. USMNT defender <strong>Matt Miazga<\/strong> was also missing from the weekend&#8217;s match, suspended for yellow card accumulation, but he returns.<\/p>\n<p>Otherwise, the FC Cincinnati lineup has remained largely unchanged, with both sides have a short turnaround for this game. There is one swap, as <strong>Alec Kann<\/strong> comes into goal as he has spelled <strong>Roman Celentano<\/strong> throughout the U.S. Open Cup.<\/p>\n<p>USMNT striker <strong>Brandon Vazquez<\/strong> scored five goals in three Leagues Cup matches, and has two goals in his two U.S. Open Cup starts, but was held off the scoresheet over the weekend by the Crew.<\/p>\n<p><strong>FC Cincinnati starting lineup (3-4-1-2):<\/strong> Kann (GK) — Hagglund, Miazga, I. Murphy — Arias, Moreno, Nwobodo, Barreal — L. Acosta — Boupendza, Vazquez.<\/p>\n<p><strong>FC Cincinnati subs (7): <\/strong>Celentano (GK), Angulo, S. Santos, Gaddis, Halsey, Powell, Kubo.<\/p>\n<p>One of the biggest tests for head coach Gerardo Martino in the coming weeks will be to figure out how to find rest for aging stars <strong>Lionel Messi<\/strong>, <strong>Sergio Busquets<\/strong> and <strong>Jordi Alba<\/strong> despite the massive importance of every game from here on out.<\/p>\n<p>&#8220;Tata&#8221; has decided to rest some other players for this match, however, amidst a host of changes. <strong>Robert Taylor<\/strong> and <strong>Benji Cremaschi<\/strong> are sat following a grueling Leagues Cup journey. 20-year-old midfielder <strong>Diego Gomez<\/strong> and 19-year-old defender <strong>Tomas Aviles<\/strong> both start, as does Brazilian midfielder <strong>Jean Mota<\/strong> who hasn&#8217;t played in months due to injury.<\/p>\n<p>Also benched is struggling striker <strong>Josef Martinez<\/strong>, as <strong>Leo Campana<\/strong> enters the attack in his place. Martino has gone with three center-backs, meaning <strong>Jordi Alba<\/strong> and <strong>DeAndre Yedlin<\/strong> will play a more attacking wing-back role.<\/p>\n<p><strong>Inter Miami starting lineup (3-5-2):<\/strong> Callender (GK) — Kryvtsov, Aviles, Miller — Yedlin, D. Gomez, Busquets, Mota, Alba — Messi, Campana.<\/p>\n<p><strong>Inter Miami subs (7):<\/strong> Dos Santos (GK), Farias, Allen, D. Ruiz, Cremaschi, R. Taylor, J. Martinez.<\/p>\n<h2><strong>How to watch FC Cincinnati vs Inter Miami<\/strong><\/h2>\n<div class=\"table-container\">\n<table border=\"1\" cellspacing=\"1\" cellpadding=\"1\">\n<thead>\n<tr>\n<th scope=\"row\"><\/th>\n<th scope=\"col\">TV channel<\/th>\n<th scope=\"col\">Streaming<\/th>\n<\/tr>\n<\/thead>\n<tbody>\n<tr>\n<th scope=\"row\">USA<\/th>\n<td>Telemundo (Spanish)<\/td>\n<td>Fubo, Paramount+, Peacock, Telemundo Deportes En Vivo, CBS Sports Golazo<\/td>\n<\/tr>\n<tr>\n<th scope=\"row\">Canada<\/th>\n<td> —<\/td>\n<td>DAZN<\/td>\n<\/tr>\n<tr>\n<th scope=\"row\">Malaysia<\/th>\n<td>Astro Supersport 2<\/td>\n<td>Astro Go, sooka<\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<\/div>\n<h2><strong>FC Cincinnati vs Inter Miami<\/strong> betting odds &amp; lines<\/h2>\n<p>Inter Miami are favorites for this match, understandably so as no team has yet managed to best them with Lionel Messi, Sergio Busquets and Jordi Alba on the side. Yet FC Cincinnati are clearly given a chance to succeed and advance to the final, with Inter Miami only sporting plus three-way moneyline odds.<\/p>\n<p>While the winner seems to be in question, there&#8217;s no debating that the betting market expects goals. The total has been inflated to 3.5, and both teams are widely expected to find the back of the net.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>After a grueling Leagues Cup run, Lionel Messi and Inter Miami seemed to be running on fumes, but they continue to conjure just enough magic required each time they step on the field. In the U.S. Open Cup semifinals on the road against FC Cincinnati, the run would live on. Inter Miami fell 2-0 down<\/p>\n","protected":false},"author":1,"featured_media":226,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[3],"tags":[],"_links":{"self":[{"href":"https:\/\/storybook.spectator.co.uk\/wp-json\/wp\/v2\/posts\/229"}],"collection":[{"href":"https:\/\/storybook.spectator.co.uk\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/storybook.spectator.co.uk\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/storybook.spectator.co.uk\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/storybook.spectator.co.uk\/wp-json\/wp\/v2\/comments?post=229"}],"version-history":[{"count":1,"href":"https:\/\/storybook.spectator.co.uk\/wp-json\/wp\/v2\/posts\/229\/revisions"}],"predecessor-version":[{"id":231,"href":"https:\/\/storybook.spectator.co.uk\/wp-json\/wp\/v2\/posts\/229\/revisions\/231"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/storybook.spectator.co.uk\/wp-json\/wp\/v2\/media\/226"}],"wp:attachment":[{"href":"https:\/\/storybook.spectator.co.uk\/wp-json\/wp\/v2\/media?parent=229"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/storybook.spectator.co.uk\/wp-json\/wp\/v2\/categories?post=229"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/storybook.spectator.co.uk\/wp-json\/wp\/v2\/tags?post=229"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}