{"id":16,"date":"2023-06-23T18:34:15","date_gmt":"2023-06-23T18:34:15","guid":{"rendered":"https:\/\/storybook.spectator.co.uk\/?page_id=16"},"modified":"2023-07-26T06:57:41","modified_gmt":"2023-07-26T06:57:41","slug":"disclaimer","status":"publish","type":"page","link":"https:\/\/storybook.spectator.co.uk\/disclaimer\/","title":{"rendered":"Disclaimer"},"content":{"rendered":"<p>Last updated: 2023-05-02<\/p>\n<p>The information provided by mc.acm.jhu.edu (“Company”, “we”, “our”, “us”) on mc.acm.jhu.edu (the “Site”) is for general informational purposes only. All information on the Site is provided in good faith, however we make no representation or warranty of any kind, express or implied, regarding the accuracy, adequacy, validity, reliability, availability, or completeness of any information on the Site.<\/p>\n<p>UNDER NO CIRCUMSTANCE SHALL WE HAVE ANY LIABILITY TO YOU FOR ANY LOSS OR DAMAGE OF ANY KIND INCURRED AS A RESULT OF THE USE OF THE SITE OR RELIANCE ON ANY INFORMATION PROVIDED ON THE SITE. YOUR USE OF THE SITE AND YOUR RELIANCE ON ANY INFORMATION ON THE SITE IS SOLELY AT YOUR OWN RISK.<\/p>\n<h2><b>EXTERNAL LINKS DISCLAIMER<\/b><\/h2>\n<p>The Site may contain (or you may be sent through the Site) links to other websites or content belonging to or originating from third parties or links to websites and features. Such external links are not investigated, monitored, or checked for accuracy, adequacy, validity, reliability, availability or completeness by us.<\/p>\n<p>WE DO NOT WARRANT, ENDORSE, GUARANTEE, OR ASSUME RESPONSIBILITY FOR THE ACCURACY OR RELIABILITY OF ANY INFORMATION OFFERED BY THIRD-PARTY WEBSITES LINKED THROUGH THE SITE OR ANY WEBSITE OR FEATURE LINKED IN ANY BANNER OR OTHER ADVERTISING. WE WILL NOT BE A PARTY TO OR IN ANY WAY BE RESPONSIBLE FOR MONITORING ANY TRANSACTION BETWEEN YOU AND THIRD-PARTY PROVIDERS OF PRODUCTS OR SERVICES.<\/p>\n<h2><b>ERRORS AND OMISSIONS DISCLAIMER<\/b><\/h2>\n<p>While we have made every attempt to ensure that the information contained in this site has been obtained from reliable sources, mc.acm.jhu.edu is not responsible for any errors or omissions or for the results obtained from the use of this information. All information in this site is provided “as is”, with no guarantee of completeness, accuracy, timeliness or of the results obtained from the use of this information, and without warranty of any kind, express or implied, including, but not limited to warranties of performance, merchantability, and fitness for a particular purpose.<\/p>\n<p>In no event will mc.acm.jhu.edu, its related partnerships or corporations, or the partners, agents or employees thereof be liable to you or anyone else for any decision made or action taken in reliance on the information in this Site or for any consequential, special or similar damages, even if advised of the possibility of such damages.<\/p>\n<h2><b>LOGOS AND TRADEMARKS DISCLAIMER<\/b><\/h2>\n<p>All logos and trademarks of third parties referenced on mc.acm.jhu.edu are the trademarks and logos of their respective owners. Any inclusion of such trademarks or logos does not imply or constitute any approval, endorsement or sponsorship of mc.acm.jhu.edu by such owners.<\/p>\n<h2><b>CONTACT US<\/b><\/h2>\n<p>Should you have any feedback, comments, requests for technical support or other inquiries, please contact us by email: <b>contact@mc.acm.jhu.edu<\/b>.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Last updated: 2023-05-02 The information provided by mc.acm.jhu.edu (“Company”, “we”, “our”, “us”) on mc.acm.jhu.edu (the “Site”) is for general informational purposes only. All information on the Site is provided in good faith, however we make no representation or warranty of any kind, express or implied, regarding the accuracy, adequacy, validity, reliability, availability, or completeness of<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"footnotes":""},"_links":{"self":[{"href":"https:\/\/storybook.spectator.co.uk\/wp-json\/wp\/v2\/pages\/16"}],"collection":[{"href":"https:\/\/storybook.spectator.co.uk\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/storybook.spectator.co.uk\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/storybook.spectator.co.uk\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/storybook.spectator.co.uk\/wp-json\/wp\/v2\/comments?post=16"}],"version-history":[{"count":10,"href":"https:\/\/storybook.spectator.co.uk\/wp-json\/wp\/v2\/pages\/16\/revisions"}],"predecessor-version":[{"id":201,"href":"https:\/\/storybook.spectator.co.uk\/wp-json\/wp\/v2\/pages\/16\/revisions\/201"}],"wp:attachment":[{"href":"https:\/\/storybook.spectator.co.uk\/wp-json\/wp\/v2\/media?parent=16"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}