{"id":19,"date":"2023-06-23T18:34:55","date_gmt":"2023-06-23T18:34:55","guid":{"rendered":"https:\/\/storybook.spectator.co.uk\/?page_id=19"},"modified":"2023-07-26T06:57:12","modified_gmt":"2023-07-26T06:57:12","slug":"about-us","status":"publish","type":"page","link":"https:\/\/storybook.spectator.co.uk\/about-us\/","title":{"rendered":"About Us"},"content":{"rendered":"<p>First of all, thank you very much for visiting us here at mc.acm.jhu.edu. We are delighted to have you here and know that you want to know about us a bit more than traditional web visitors.<\/p>\n<p>10sports.live is a result of a few dedicated &amp; committed sports professionals who want to share their sports knowledge and the latest sports update with you. Sports analysis and news are very crucial and significant for people who love watching sports of any kind.<\/p>\n<p>We have a dedicated team of sports enthusiasts who works here and help people get the latest sports news like, Football, Soccer, NFL, NBA, NHL, Baseball, Ice Hockey, and the list goes more and more. So, if you want to be with the updates, you are at the right place where you should be.<\/p>\n<p>Yes, the sports industry is evolving from the beginning, and to keep yourself included in that evolving world, you need to be informed always. 10sports.live is here to help you out of this situation because our 100+ writers are working day &amp; night to0 serve the latest sports news before anyone in the world.<\/p>\n<p>We have covered the most important Football Leagues, NCAA, NHL Leagues, NBA Leagues, Premier Leagues, Cricket Leagues, Championships, etc. No there is nothing we don’t cover when it comes to sports-related activities.<\/p>\n<p>Our professionals keep their eyes on every single activity worldwide to get information that technically you can’t. After figuring out the foundation of that information, we start writing that information and publish them on 10sports.live.<\/p>\n<p>Wherever you are, we don’t consider any location-specific news, we cover everything necessary for people like you and us here at 10sports.live. Our primary goal is to showcase the latest information about your favorite sports program that you need to know.<\/p>\n<p>So, help us continue this initiative by sharing our news, articles, and opinions with the rest of the world. Let them know about our effort and the way we are keeping you updated every second on your favorite sports activities. Share our links with your closest people and tell them to share with theirs’ too.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>First of all, thank you very much for visiting us here at mc.acm.jhu.edu. We are delighted to have you here and know that you want to know about us a bit more than traditional web visitors. 10sports.live is a result of a few dedicated &amp; committed sports professionals who want to share their sports knowledge<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"footnotes":""},"_links":{"self":[{"href":"https:\/\/storybook.spectator.co.uk\/wp-json\/wp\/v2\/pages\/19"}],"collection":[{"href":"https:\/\/storybook.spectator.co.uk\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/storybook.spectator.co.uk\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/storybook.spectator.co.uk\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/storybook.spectator.co.uk\/wp-json\/wp\/v2\/comments?post=19"}],"version-history":[{"count":10,"href":"https:\/\/storybook.spectator.co.uk\/wp-json\/wp\/v2\/pages\/19\/revisions"}],"predecessor-version":[{"id":200,"href":"https:\/\/storybook.spectator.co.uk\/wp-json\/wp\/v2\/pages\/19\/revisions\/200"}],"wp:attachment":[{"href":"https:\/\/storybook.spectator.co.uk\/wp-json\/wp\/v2\/media?parent=19"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}